SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( CP1521  
	Type ( Engine )
	WagonShape ( cp1521.s )
	Include ( "Openrails/1general.inc" )
	Include ( "Openrails/2brakew.inc" )
	Include ( "Openrails/3friction.inc" )
	Include ( "Openrails/4light.inc" )

	IntakePoint ( -3.33 0.4 FuelDiesel )
	IntakePoint ( 3.33 0.4 FuelDiesel )
)

Engine ( CP1521
	Wagon ( Cp1521 )
	Name ( "CP 1521 Alco" )
	Sound ( 1520cab.sms )
	CabView ( Cp1520.cvf )

	Include ( "Openrails/effects.inc" )
	Include ( "Openrails/5engine.inc" )
	Include ( "Openrails/6brakesys.inc" )
	Include ( "Openrails/7other.inc" )
 	Include ( "Openrails/9controllers.inc" )
	Include ( "Openrails/procedures1520.inc" )

	VigilanceMonitor(
		MonitoringDeviceAlarmTimeLimit		( 45s )
		MonitoringDeviceMonitorTimeLimit		( 37s )
		MonitoringDevicePenaltyTimeLimit		( 1s )
		MonitoringDeviceCriticalLevel			( 0 )
		MonitoringDeviceResetLevel			( 0 )
		MonitoringDeviceAppliesFullBrake		( 1 )
		MonitoringDeviceAppliesEmergencyBrake	( 0 )
		MonitoringDeviceAppliesCutsPower		( 1 )
		MonitoringDeviceAppliesShutsDownEngine	( 1 )
		MonitoringDeviceResetOnDirectionNeutral	( 0 )
		MonitoringDeviceResetOnResetButton		( 1 )
		MonitoringDeviceResetOnZeroSpeed 		( 1 )
	)	
	EmergencyStopMonitor(
		MonitoringDeviceAlarmTimeLimit 		( 2 )
		MonitoringDeviceMonitorTimeLimit 		( 5 )
		MonitoringDevicePenaltyTimeLimit 		( 0 )
		MonitoringDeviceCriticalLevel 		( 106 )
		MonitoringDeviceResetLevel 			( 0 )
		MonitoringDeviceAppliesFullBrake 		( 0 )
		MonitoringDeviceAppliesEmergencyBrake 	( 1 )
		MonitoringDeviceAppliesCutsPower 		( 1 )
		MonitoringDeviceAppliesShutsDownEngine 	( 1 )
		MonitoringDeviceResetOnDirectionNeutral	( 0 )
		MonitoringDeviceResetOnResetButton 		( 1 )
		MonitoringDeviceResetOnZeroSpeed 		( 0 )
	)
	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit		( 0 )
		MonitoringDeviceAlarmTimeLimit		( 0 )
		MonitoringDevicePenaltyTimeLimit		( 0 )
		MonitoringDeviceCriticalLevel			( 130 )
		MonitoringDeviceResetLevel			( 0 )
		MonitoringDeviceAppliesFullBrake		( 1 )
		MonitoringDeviceAppliesEmergencyBrake	( 1 )
		MonitoringDeviceAppliesCutsPower		( 1 )
		MonitoringDeviceAppliesShutsDownEngine	( 0 )
		MonitoringDeviceTriggerOnTrackOverspeed	( 1 )
		MonitoringDeviceTriggerOnTrackOverspeedMargin( 2 )
		MonitoringDeviceResetOnZeroSpeed		( 1 )
		MonitoringDeviceResetOnResetButton		( 0 )
	)
    	Description (	
		"CP 1520 Series diesel-electric locomotive\n"+
		"Entered service in 1951\n"+
		"Wheel Arrangement: A1A A1A\n"+
		"Brake Type: Air - Twin pipe\n"+
		"Livery: Orange and White"
    	)
)